### Pandas 기초

In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1,3,5,np.nan,6,8]) #NaN은 아무것도 없는(빈) 값
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D']) #DataFrame은 딕셔너리나 array형 자료를 받습니다
df

                   A         B         C         D
2013-01-01 -1.941040 -0.977859  0.087031  0.757677
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911
2013-01-04  2.316365  1.490382 -0.298976  0.561835
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060
2013-01-06  0.901698  1.514209  1.672329  1.842993

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.values

array([[-1.94103999, -0.97785949,  0.08703064,  0.75767718],
       [ 0.17687088, -0.23512859,  2.34485285, -0.55487012],
       [-0.29402826, -0.41605942, -0.58618267,  0.09491074],
       [ 2.3163646 ,  1.49038165, -0.29897601,  0.56183494],
       [-1.35314041, -0.12436266, -1.00567747, -1.50206004],
       [ 0.90169821,  1.51420946,  1.6723287 ,  1.84299284]])

In [27]:
df.describe() #각종 요약값 제공

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.032212  0.208530  0.368896  0.200081
std    1.541995  1.044340  1.336448  1.150585
min   -1.941040 -0.977859 -1.005677 -1.502060
25%   -1.088362 -0.370827 -0.514381 -0.392425
50%   -0.058579 -0.179746 -0.105973  0.328373
75%    0.720491  1.086696  1.276004  0.708717
max    2.316365  1.514209  2.344853  1.842993

In [28]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-06  0.901698  1.514209  1.672329  1.842993
2013-01-04  2.316365  1.490382 -0.298976  0.561835
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911
2013-01-01 -1.941040 -0.977859  0.087031  0.757677

In [29]:
df['B']

2013-01-01   -0.977859
2013-01-02   -0.235129
2013-01-03   -0.416059
2013-01-04    1.490382
2013-01-05   -0.124363
2013-01-06    1.514209
Freq: D, Name: B, dtype: float64

In [30]:
df[0:3] #슬라이싱은 행 단위로 실행

                   A         B         C         D
2013-01-01 -1.941040 -0.977859  0.087031  0.757677
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911

In [31]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911
2013-01-04  2.316365  1.490382 -0.298976  0.561835

In [32]:
df.loc[dates[0]]

A   -1.941040
B   -0.977859
C    0.087031
D    0.757677
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.941040 -0.977859
2013-01-02  0.176871 -0.235129
2013-01-03 -0.294028 -0.416059
2013-01-04  2.316365  1.490382
2013-01-05 -1.353140 -0.124363
2013-01-06  0.901698  1.514209

In [34]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.176871 -0.235129
2013-01-03 -0.294028 -0.416059
2013-01-04  2.316365  1.490382

In [35]:
df.loc[dates[0], 'A']

-1.941039987759197

In [36]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  2.316365  1.490382
2013-01-05 -1.353140 -0.124363

In [37]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.176871  2.344853
2013-01-03 -0.294028 -0.586183
2013-01-05 -1.353140 -1.005677

In [38]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911

In [39]:
df[df['A']>0]

                   A         B         C         D
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-04  2.316365  1.490382 -0.298976  0.561835
2013-01-06  0.901698  1.514209  1.672329  1.842993

In [40]:
df[df>0] #value가 0이상인 값만 반환하고 이외에는 NaN 형태로 반환

                   A         B         C         D
2013-01-01       NaN       NaN  0.087031  0.757677
2013-01-02  0.176871       NaN  2.344853       NaN
2013-01-03       NaN       NaN       NaN  0.094911
2013-01-04  2.316365  1.490382       NaN  0.561835
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.901698  1.514209  1.672329  1.842993

In [66]:
df2 = df.copy() #원본 df에는 변화를 적용하고 싶지 않다면 copy()를 사용해야 한다. 그냥 df2 = df로 하면 df2에 적용된 코드가 df에도 적용됨.
df2

                   A         B         C         D
2013-01-01 -1.941040 -0.977859  0.087031  0.757677
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911
2013-01-04  2.316365  1.490382 -0.298976  0.561835
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060
2013-01-06  0.901698  1.514209  1.672329  1.842993

In [67]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [68]:
df2

                   A         B         C         D      E
2013-01-01 -1.941040 -0.977859  0.087031  0.757677    one
2013-01-02  0.176871 -0.235129  2.344853 -0.554870    two
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911  three
2013-01-04  2.316365  1.490382 -0.298976  0.561835   four
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060   five
2013-01-06  0.901698  1.514209  1.672329  1.842993    six

In [43]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [44]:
df2[df2['E'].isin(['two', 'four'])] #'E'행의 값이 'two'나 'four'인 열들을 반환

                   A         B         C         D     E
2013-01-02  0.176871 -0.235129  2.344853 -0.554870   two
2013-01-04  2.316365  1.490382 -0.298976  0.561835  four

In [70]:
df2.drop('E',axis = 1)

                   A         B         C         D
2013-01-01 -1.941040 -0.977859  0.087031  0.757677
2013-01-02  0.176871 -0.235129  2.344853 -0.554870
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911
2013-01-04  2.316365  1.490382 -0.298976  0.561835
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060
2013-01-06  0.901698  1.514209  1.672329  1.842993

In [71]:
df2

                   A         B         C         D      E
2013-01-01 -1.941040 -0.977859  0.087031  0.757677    one
2013-01-02  0.176871 -0.235129  2.344853 -0.554870    two
2013-01-03 -0.294028 -0.416059 -0.586183  0.094911  three
2013-01-04  2.316365  1.490382 -0.298976  0.561835   four
2013-01-05 -1.353140 -0.124363 -1.005677 -1.502060   five
2013-01-06  0.901698  1.514209  1.672329  1.842993    six

In [72]:
df2 = df2.drop('E',axis = 1)

### DataFrame 병합하기

#### concat

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index = [8,9,10,11])

In [50]:
result = pd.concat([df1, df2, df3]) #열 방향으로 dataframe을 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [56]:
result = pd.concat([df1, df2, df3], keys = ['x', 'y','z']) #key는 인덱스와 비슷하다고 보면 됩니다
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [57]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [58]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [59]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [41]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

#### join

In [42]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K4
2  A2  B2  K2
3  A3  B3  K3

In [43]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [44]:
pd.merge(left, right, on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A2  B2  K2  C2  D2
2  A3  B3  K3  C3  D3

In [45]:
pd.merge(left, right, how = 'left', on = 'key') #왼쪽 데이터프레임을 기준으로 병합

    A   B key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K4  NaN  NaN
2  A2  B2  K2   C2   D2
3  A3  B3  K3   C3   D3

In [46]:
pd.merge(left, right, how = 'right', on = 'key')

     A    B key   C   D
0   A0   B0  K0  C0  D0
1   A2   B2  K2  C2  D2
2   A3   B3  K3  C3  D3
3  NaN  NaN  K1  C1  D1

In [54]:
pd.merge(left, right, how = 'outer', on = 'key') #how 값의 기본 옵션은 inner(교집합)이다

     A    B key    C    D
0   A0   B0  K0   C0   D0
1   A1   B1  K4  NaN  NaN
2   A2   B2  K2   C2   D2
3   A3   B3  K3   C3   D3
4  NaN  NaN  K1   C1   D1